import os

# Период анализа
START_YEAR = 2024
END_YEAR = 2025

# Настройки инфраструктуры и путей
RAW_DATA_DIR = "data/raw/"
PROCESSED_DATA_DIR = "data/processed/"
OUTPUT_CSV_NAME = "sber_purchases_2024_2025.csv"
OUTPUT_FILE_PATH = os.path.join(RAW_DATA_DIR, OUTPUT_CSV_NAME)

# Настройки подключения к PostgreSQL
DB_CONFIG = {
    "host": "localhost",
    "database": "sber_tenders",
    "user": "postgres",
    "password": "super_secure_password123"
}

# Строка подключения для SQLAlchemy
DATABASE_URL = f"postgresql+psycopg2://{DB_CONFIG['user']}:{DB_CONFIG['password']}@{DB_CONFIG['host']}:5432/{DB_CONFIG['database']}"

# Параметры FTP ЕИС
FTP_HOST = "ftp.zakupki.gov.ru"
FTP_USER = "free"
FTP_PASS = "free"
FTP_CWD_PATH = '/fks_223/purchaseNotice/'

# Справочник дочерних структур Сбера
CUSTOMERS = {
    "7707083893": "ПАО Сбербанк",
    "7710048970": "АО Сбербанк КИБ",
    "7736663049": "ООО СБЕРБАНК-СЕРВИС",
    "7736632467": "АО СберТех",
    "7704211201": "АО Сбербанк Лизинг",
    "7706810747": "ООО Сбербанк Страхование"
}

# Справочник категорий и типов лотов
CATEGORIES = {
    "IT-оборудование и ПО": [
        "Поставка серверов и СХД",
        "Лицензии технической поддержки СУБД",
        "Ноутбуки для сотрудников",
        "Разработка модулей фронтенда"
    ],
    "Строительство и ремонты": [
        "Ремонт central'ного офиса",
        "Строительство модульного ЦОД",
        "Техническое обслуживание инженерных систем"
    ],
    "Консалтинг и аудит": [
        "Аудит финансовых рисков",
        "Юридическое сопровождение сделок"
    ],
    "Маркетинг и реклама": [
        "Размещение наружной рекламы",
        "Организация конференции СберЭкспо"
    ]
}

# Пул валидных поставщиков
SUPPLIERS_POOL = [
    {"inn": "7710123456", "name": "ООО ТехноПромИнжиниринг"},
    {"inn": "7704987654", "name": "АО ИнфоСистемы"},
    {"inn": "7801112233", "name": "ООО СтройМагистраль"},
    {"inn": "7715556677", "name": "ООО СберИнтеграция (Аномальный монополист)"},
    {"inn": "5001002003", "name": "ИП Иванов А.В. (Обезличен)"}
]